# 2. Напишите программу, которая найдёт произведение пар чисел 
# списка. Парой считаем первый и последний элемент, 
# второй и предпоследний и т.д.


# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

my_list = [8, 1, 3, 9, 5]
result_list = []
for i in range(int(len(my_list)/2)+1):
    result_list.append(my_list[i]*my_list[len(my_list)-1-i])
print(result_list)